cmsis-svd/cmsis-svd/data/Microchip/ATSAML21JxB.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <version>1.1.2</version>
      <description>Digital-to-Analog Converter</description>
      <groupName>DAC</groupName>
      <prependToName>DAC_</prependToName>
      <baseAddress>0x42003000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DAC</name>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable DAC Controller</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DIFF</name>
              <description>Differential mode enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Reference Selection for DAC0/1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>REFSELSelect</name>
                <enumeratedValue>
                  <name>VREFPU</name>
                  <description>External reference unbuffered</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDANA</name>
                  <description>Analog supply</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFPB</name>
                  <description>External reference buffered</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTREF</name>
                  <description>Internal bandgap reference</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>STARTEI0</name>
              <description>Start Conversion Event Input DAC 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STARTEI1</name>
              <description>Start Conversion Event Input DAC 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMPTYEO0</name>
              <description>Data Buffer Empty Event Output DAC 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMPTYEO1</name>
              <description>Data Buffer Empty Event Output DAC 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEI0</name>
              <description>Enable Invertion of DAC 0 input event</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEI1</name>
              <description>Enable Invertion of DAC 1 input event</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>UNDERRUN0</name>
              <description>Underrun Interrupt Enable for DAC 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNDERRUN1</name>
              <description>Underrun Interrupt Enable for DAC 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMPTY0</name>
              <description>Data Buffer 0 Empty Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMPTY1</name>
              <description>Data Buffer 1 Empty Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>UNDERRUN0</name>
              <description>Underrun Interrupt Enable for DAC 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNDERRUN1</name>
              <description>Underrun Interrupt Enable for DAC 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMPTY0</name>
              <description>Data Buffer 0 Empty Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMPTY1</name>
              <description>Data Buffer 1 Empty Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>UNDERRUN0</name>
              <description>DAC 0 Underrun</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UNDERRUN1</name>
              <description>DAC 1 Underrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMPTY0</name>
              <description>Data Buffer 0 Empty</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMPTY1</name>
              <description>Data Buffer 1 Empty</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x07</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>READY0</name>
              <description>DAC 0 Startup Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READY1</name>
              <description>DAC 1 Startup Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EOC0</name>
              <description>DAC 0 End of Conversion</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EOC1</name>
              <description>DAC 1 End of Conversion</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>DAC Enable Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA0</name>
              <description>Data DAC 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Data DAC 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATABUF0</name>
              <description>Data Buffer DAC 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATABUF1</name>
              <description>Data Buffer DAC 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>DACCTRL%s</name>
          <description>DAC n Control</description>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>LEFTADJ</name>
              <description>Left Adjusted Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable DAC0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTRL</name>
              <description>Current Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CCTRLSelect</name>
                <enumeratedValue>
                  <name>CC100K</name>
                  <description>GCLK_DAC &lt;= 1.2MHz (100kSPS)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1M</name>
                  <description>1.2MHz &lt; GCLK_DAC &lt;= 6MHz (500kSPS)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC12M</name>
                  <description>6MHz &lt; GCLK_DAC &lt;=12MHz (1MSPS)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DITHER</name>
              <description>Dithering Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REFRESH</name>
              <description>Refresh period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>DATA%s</name>
          <description>DAC n Data</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>DAC0 Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>DATABUF%s</name>
          <description>DAC n Data Buffer</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATABUF</name>
              <description>DAC0 Data Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
